Revit 2024 API
DocumentSynchronizingWithCentralEventArgs Class
 The event arguments used by the DocumentSynchronizingWithCentralEventArgs event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class DocumentSynchronizingWithCentralEventArgs : RevitAPIPreDocEventArgs
Visual Basic
Public Class DocumentSynchronizingWithCentralEventArgs _
	Inherits RevitAPIPreDocEventArgs
Visual C++
public ref class DocumentSynchronizingWithCentralEventArgs : public RevitAPIPreDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs
See Also
DocumentSynchronizingWithCentralEventArgs Members
Autodesk.Revit.DB.Events Namespace